artillery.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - name: "Catch a ride"
    flow:
      - loop:
        - get:
            url: "/zone"
        # - delete:
        #     url: "/driver"
        # - post:
        #     url: "/driver"
        count: 100